Repository: applingua/WelshAppTMX
Catalog: Welsh App TMX by Applingua Ltd.tmx
Source language: en
Languages: cy

source: It is best if your devices are set as close as possible.
cy: Mae'n well os yw'ch dyfeisiau wedi'u gosod mor agos â phosibl.

source: Shopping cart is loading…
cy: Mae'r cert siopa wrthi'n llwytho…

source: Verify code expired
cy: Mae'r cod dilysu wedi dod i ben

source: Verify code has expired.
cy: Mae'r cod dilysu wedi dod i ben.

source: Verify code is invalid. Please try again.
cy: Mae'r cod dilysu yn annilys. Rhowch gynnig arall arni.

source: Verification code is too short
cy: Mae'r cod dilysu yn rhy fyr

source: Verification code is too long
cy: Mae'r cod dilysu yn rhy hir

source: That email address or password is incorrect.
cy: Mae'r cyfeiriad e-bost neu'r cyfrinair yna yn anghywir.

source: Email is already in use :/
cy: Mae'r cyfeiriad e-bost yna eisoes yn cael ei defnyddio :/

source: This Facebook account is linked to other user.
cy: Mae'r cyfrif Facebook hwn yn gysylltiedig â defnyddwyr eraill.

source: The account with this email or cloud name already exist. If you created it, please try to sign in.
cy: Mae'r cyfrif gyda'r e-bost neu enw cwmwl hwn eisoes yn bodoli. Os mai chi greodd hi, rhowch gynnig ar fewngofnodi.

source: Selected date overlaps with
cy: Mae'r dyddiad a ddetholwyd yn gorgyffwrdd gyda

source: Email already in use
cy: Mae'r e-bost eisoes yn cael ei ddefnyddio

source: Email is in use
cy: Mae'r e-bost eisoes yn cael ei defnyddio

source: This email is already in use.
cy: Mae'r e-bost hwn yn cael ei defnyddio eisoes.

source: Email already exists!
cy: Mae'r ebost eisoes yn bodoli!

source: This item is now fully upgraded!
cy: Mae'r eitem yma bellach wedi uwchraddio'n llawn!

source: Your purchase have been restored
cy: Mae'r eitemau rydych wedi eu prynu wedi cael eu hadfer

source: Username already exists!
cy: Mae'r enw defnyddiwr eisoes yn bodoli!

source: Username is in use
cy: Mae'r enw defnyddiwr eisoes yn cael ei defnyddio

source: That username is taken. Try another?
cy: Mae'r enw defnyddiwr hwn eisoes wedi'i gymryd. Trio un arall?

source: This username is already taken.
cy: Mae'r enw defnyddiwr hwn eisoes yn cael ei defnyddio.

source: Username is occupied
cy: Mae'r enw defnyddiwr wedi'i gymryd

source: Your username contains some restricted characters.
cy: Mae'r enw defnyddiwr yn cynnwys nodau cyfyngedig

source: File already exists!
cy: Mae'r ffeil eisoes yn bodoli!

source: Video is still uploading…
cy: Mae'r fideo yn dal i lwytho…

source: Match has ended
cy: Mae'r gêm wedi dod i ben

source: Match has ended. Stay tuned for VoDs.
cy: Mae'r gêm wedi gorffen. Parhewch i wylio ar gyfer VoDs.

source: Overtime is turned off. You can activate it in settings
cy: Mae'r goramser wedi'i droi i ffwrdd. Gallwch ei alluogi yn y gosodiadau

source: History is empty.
cy: Mae'r hanes yn wag.

source: Location is off
cy: Mae'r lleoliad wedi'i ddiffodd

source: Quantity is invalid, it must be greater then 0
cy: Mae'r nifer yn annilys, rhaid iddo fod yn fwy yna 0

source: Premium features also include Advanced functions & Themes.
cy: Mae'r nodweddion premiwm hefyd yn cynnwys swyddogaethau uwch a themâu.

source: Premium features also include Converter & Advanced functions.
cy: Mae'r nodweddion premiwm hefyd yn cynnwys troswr a swyddogaethau uwch.

source: Premium features also include Converter & Themes.
cy: Mae'r nodweddion premiwm hefyd yn cynnwys troswr a themâu.

source: Price %@ is invalid
cy: Mae'r pris %@ yn annilys

source: Price is invalid, it must be greater then 0
cy: Mae'r pris yn annilys, rhaid iddo fod yn fwy yna 0

source: These allow us to distinguish you from other users of the website which allows us to improve our site.
cy: Mae'r rhain yn ein caniatáu i'ch gwahaniaethu oddi wrth ddefnyddwyr eraill y wefan sy'n ein galluogi i wella'n safle ni.

source: Number is in use
cy: Mae'r rhif eisoes yn cael ei defnyddio

source: This phone number is already registered
cy: Mae'r rhif ffôn hwn eisoes wedi'i gofrestru

source: Advanced functions are only available in the Premium version.
cy: Mae'r swyddogaethau uwch ar gael yn y fersiwn Premiwm yn unig.

source: Converter is only available in the Premium version.
cy: Mae'r troswr ar gael yn y fersiwn Premiwm yn unig.

source: Airport
cy: Maes awyr

source: Airport, %@
cy: Maes awyr, %@

source: Optional field
cy: Maes dewisol

source: May
cy: Mai

source: Magnitude
cy: Maint

source: Size
cy: Maint

source: Sizing
cy: Maint

source: Output size
cy: Maint allbwn

source: Export Size
cy: Maint allgludo

source: Custom Size
cy: Maint personol

source: Image Size
cy: Maint y ddelwedd

source: Kingdom Size
cy: Maint y Deyrnas

source: Font Size
cy: Maint y ffont

source: Grid Size
cy: Maint y grid

source: Native language
cy: Mamiaith

source: Birthplace
cy: Man geni

source: D[APPNAME]iled
cy: Manwl

source: details
cy: Manylion

source: Product details
cy: Manylion y cynnyrch

source: Pass details
cy: Manylion y daith

source: PROFILE details
cy: MANYLION Y PROFFIL

source: Look details
cy: Manylion y steil

source: Map %1$@ out of %2$@
cy: Map %1$@ allan o %2$@

source: Map %1$d of %2$d
cy: Map %1$d o %2$d

source: Airport Map
cy: Map o'r maes awyr

source: Maps
cy: Mapiau

source: Market
cy: Marchnad

source: Grand Market
cy: Marchnad Fawr

source: Marketing
cy: Marchnata

source: Metric Horsepower
cy: Marchnerth Metrig

source: Knights
cy: Marchogion

source: Mark as non billable
cy: Marcio fel rhai ni ellir bilio amdanynt

source: Mark as billable
cy: Marcio fel rhai y gellir bilio amdanynt

source: Marker %d
cy: Marciwr %d

source: Start marker
cy: Marciwr cychwyn llinell

source: End marker
cy: Marciwr diwedd llinell

source: Marked as
cy: Marciwyd fel

source: End Markers
cy: Marcwyr diwedd llinell

source: Deaths
cy: Marwolaethau

source: Kills
cy: Marwolaethau

source: Deaths/Round
cy: Marwolaethau/Rownd

source: Kills/Round
cy: Marwolaethau/Rownd

source: Mass
cy: Màs

source: Fair Trades
cy: Masnachau Teg

source: Type
cy: Math

source: Export Type
cy: Math allgludo

source: File type
cy: Math o ffeil

source: Font Type
cy: Math o ffont

source: Expense type
cy: Math o gost

source: Expected content type %1$@, got %2$@
cy: Math o gynnwys disgwyliedig %1$@, derbyniwyd %2$@

source: Overtime type
cy: Math o oramser

source: Forecast Type
cy: Math o ragolwg

source: Large
cy: Mawr

source: Extra large
cy: Mawr iawn

source: March
cy: Mawrth

source: Possession
cy: Meddiant

source: September
cy: Medi

source: Billable
cy: Medru bilio

source: Megabyte
cy: Megabeit

source: MEGABOMB
cy: MEGABOM

source: June
cy: Mehefin

source: Lipsync to your music
cy: Meimio i'ch cerddoriaeth

source: Yellow
cy: Melyn

source: Green Yellow
cy: Melynwyrdd

source: Newton Meters
cy: Mesuryddion Newton

source: Request Failed.
cy: Methodd y cais.

source: Dropbox export upload operation failed due to application timeout
cy: Methodd y dasg o allgludo ar Dropbox oherwydd terfyn amser y rhaglen

source: Dropbox download operation failed due to application timeout
cy: Methodd y dasg o lawrlwytho ar Dropbox oherwydd terfyn amser y rhaglen

source: Unable to restore
cy: Methu adfer

source: Unable to restore this backup.
cy: Methu adfer y copi wrth gefn hwn.

source: Unable to restore backup, with error: %@.
cy: Methu adfer y copi wrth gefn, gyda'r gwall: %@.

source: Can not connect to FTP Server
cy: Methu cysylltu â Gweinydd FTP

source: %d entries can't be imported!
cy: Methu mewngludo %d cofnod!

source: Unable to determine the status of iCloud, but you can disconnect from it.
cy: Methu pennu statws iCloud, ond gallwch ddatgysylltu ohono.

source: Unable to move to iCloud. Try again later.
cy: Methu symud i iCloud. Rhowch gynnig arall arni nes ymlaen.

source: E-Mail sending failed
cy: Methwyd anfon yr e-bost

source: Meter
cy: Metr

source: Meters (m)
cy: Metr (m)

source: Meter/Hour
cy: Metr/Awr

source: Meter/Sec
cy: Metr/Eil

source: Meter/Min
cy: Metr/Mun

source: Meter²
cy: Metr²

source: Meter³
cy: Metr³

source: Meters descended
cy: Metrau a ddisgynnwyd

source: Meters travelled
cy: Metrau a deithiwyd

source: Meters flown
cy: Metrau a hedfanwyd

source: Meters flown (proximity)
cy: Metrau a hedfanwyd (agosrwydd)

source: Meters grinded
cy: Metrau a sglefriwyd

source: In 3 days
cy: Mewn 3 diwrnod

source: In 3 months
cy: Mewn 3 mis

source: Inline
cy: Mewn Llinell

source: In a month
cy: Mewn mis

source: In a week
cy: Mewn wythnos

source: In reply to my comments
cy: Mewn ymateb i fy sylwadau

source: INPUT VALUE
cy: MEWNBYNNU GWERTH

source: Import Employees from Contacts
cy: Mewngludo Gweithwyr o'r Cysylltiadau

source: Import Employees From Contacts
cy: Mewngludo Gweithwyr o'r Cysylltiadau

source: Import from contacts
cy: Mewngludo o'r cysylltiadau

source: Export/Import & Print
cy: Allgludo/Mewngludo ac argraffu

source: Import
cy: Mewngludo

source: Import old designs
cy: Mewngludo hen ddyluniadau

source: Import to Local
cy: Mewngludo i ddyfais leol

source: Import to iCloud
cy: Mewngludo i iCloud

source: Dropbox import
cy: Mewngludo o Dropbox

source: Import designs to Local
cy: Mewngludo'r dyluniadau i ddyfais leol

source: Imported on:
cy: Mewngludwyd ar:

source: Sign in to Game Center to compete with friends!
cy: Mewngofnoda i'r Game Center i gystadlu gyda ffrindiau

source: Log In
cy: Mewngofnodi

source: Login
cy: Mewngofnodi

source: Sign in
cy: Mewngofnodi

source: Sign in again
cy: Mewngofnodi eto

source: Login with Facebook
cy: Mewngofnodi gyda Facebook

source: SIGN IN WITH FACEBOOK
cy: MEWNGOFNODI GYDA FACEBOOK

source: Sign up with Facebook
cy: Mewngofnodi gyda Facebook

source: Login with Google
cy: Mewngofnodi gyda Google

source: Sign in with Google
cy: Mewngofnodi gyda Google

source: Sign in with Google +
cy: Mewngofnodi gyda Google +

source: log in with your e-mail
cy: mewngofnodi gyda'ch ebost

source: sign in with your e-mail
cy: mewngofnodi gyda'ch ebost

source: Log in with email
cy: Mewngofnodi gydag e-bost

source: Log in with Instagram
cy: Mewngofnodi gydag Instagram

source: Sign in to Google Play?
cy: mewngofnodi i Google Play?

source: Please login in order to use synchronization
cy: Mewngofnodwch er mwyn cysoni

source: Sign me in
cy: Mewngofnodwch fi

source: Please login to a Facebook account to share.
cy: Mewngofnodwch i'ch cyfrif ar Facebook i rannu.

source: Please login to a Twitter account to share.
cy: Mewngofnodwch i'ch cyfrif ar Twitter i rannu.

source: Signed in as
cy: Mewngofnodwyd fel

source: Insert Image…
cy: Mewnosod delwedd…

source: Continuous Insert
cy: Mewnosod di-dor

source: Export fields for time entries
cy: Meysydd allgludo ar gyfer cofnodion amser

source: Airports
cy: Meysydd awyr

source: Milliliters
cy: Mililitrau

source: Milimeter
cy: Milimedr

source: Milimeter²
cy: Milimedr²

source: Milimeter³
cy: Milimedr³

source: Millimeters
cy: Milimetr

source: Millimeters (mm)
cy: Milimetr (mm)

source: Militia
cy: Milisia

source: Milliamperes
cy: Milliamperau

source: Mile
cy: Milltir

source: miles
cy: milltir

source: Miles
cy: Milltir

source: Miles/Hour
cy: Milltir/Awr

source: Miles/Sec
cy: Milltir/Eil

source: Miles/Min
cy: Milltir/Mun

source: Miles²
cy: Milltir²

source: Mileage
cy: Milltiroedd

source: Nautical Miles
cy: Milltiroedd Morwrol

source: Miles/Sec²
cy: Milltiroedd/Eil²

source: Miles³
cy: Milltiroedd³

source: Month
cy: Mis

source: last month
cy: mis diwethaf

source: this month
cy: mis hwn

source: Month to week
cy: Mis i wythnos

source: month_
cy: mis_

source: Months
cy: Misoedd

source: Monthly
cy: Misol

source: Masquerade
cy: Misyrnddawns

source: PIG
cy: MOCHYN

source: in
cy: mod

source: Selection mode
cy: Modd dewis

source: Famous mode
cy: Modd enwog

source: Offline mode
cy: Modd heb gysylltu

source: Glance Mode
cy: Modd sydyn

source: DARK MODE
cy: MODD TYWYLL

source: zen mode
cy: modd Zen

source: Inches
cy: Modfedd

source: Inches (in)
cy: Modfedd (in)

source: Inches/Hour
cy: Modfedd/Awr

source: Inches/Sec
cy: Modfedd/Eil

source: Inches/Min
cy: Modfedd/Mun

source: Inches²
cy: Modfedd²

source: Inches³
cy: Modfedd³

source: Inches Water
cy: Modfeddi Dŵr

source: Inches Mercury
cy: Modfeddi Mercwri

source: Mermaid
cy: Môr-forwyn

source: Pirate
cy: Môr-leidr

source: High Seas
cy: Moroedd Mawr

source: Migration
cy: Mudo

source: Migrating %d of %d entries
cy: Mudo %d cofnod o %d

source: Migrating %d of %d expenses
cy: Mudo %d cost traul o %d

source: Migrating %d of %d projects
cy: Mudo %d prosiect o %d

source: Migrate Data
cy: Mudo Data

source: Migrate old version designs:
cy: Mudo hen fersiynau dyluniadau:

source: Migrating settings
cy: Mudo'r gosodiadau

source: min.
cy: mun.

source: minute
cy: munud

source: Minutes
cy: Munudau

source: MONKEY
cy: MWNCI

source: More
cy: Mwy

source: Greater than
cy: Mwy na

source: Greater than or equal
cy: Mwy na neu'n gyfartal

source: More cool apps
cy: Mwy o apiau gwych

source: MORE LANGUAGES (%@)
cy: MWY O IEITHOEDD (%@)

source: More features.
cy: Mwy o nodweddion.

source: More options
cy: Mwy o opsiynau

source: More looks with this product
cy: Mwy o steiliau gyda'r cynnyrch hwn

source: More functions
cy: Mwy o swyddogaethau

source: More info
cy: Mwy o wybodaeth

source: More…
cy: Mwy…

source: Max hours spent on
cy: Mwyaf o oriau a dreuliwyd ar

source: Most Popular
cy: Mwyaf Poblogaidd

source: Top Paid
cy: Mwyaf Poblogaidd â thâl

source: Mine
cy: Mwynglawdd

source: Enjoy a nice dinner
cy: Mwynhau cinio blasus

source: Happy scheduling!
cy: Mwynhewch yr amserlennu!

source: MPH
cy: MYA

source: Go
cy: Mynd

source: Take a Tour
cy: Mynd ar daith

source: GO AD FREE NOW
cy: MYND HEB HYSBYSEBION NAWR

source: Goto Cart
cy: Mynd i'r Cert

source: Level Up
cy: Mynd i'r lefel nesaf

source: Goto Wishlist
cy: Mynd i'r Rhestr Ddymuniadau

source: Conveniently one tap into directions straight from Spotlight search.
cy: Mynd yn gyfleus gydag un tap i gyfarwyddiadau yn syth o chwilio yn Sbotolau.

source: Go back to login
cy: Mynd yn ôl i fewngofnodi

source: Entrance
cy: Mynedfa

source: Quick access and interaction with your favourite digital content
cy: Mynediad cyflym a rhyngweithio gyda'ch hoff gynnwys digidol

source: Access is restricted
cy: Mynediad cyfyngedig

source: Easier Access
cy: Mynediad haws

source: Expression
cy: Mynegiad

source: don't
cy: na

source: No
cy: Na

source: No, send feedback
cy: Na, anfon adborth

source: No, I have a star allergy.
cy: Na, mae gennyf alergedd i sêr.

source: Natural
cy: Naturiol

source: just now
cy: nawr

source: Now
cy: Nawr

source: Message
cy: Neges

source: Message - Chart
cy: Neges - Siart

source: Message - Then
cy: Neges - Wedyn

source: Message (optional, email only)
cy: Neges (dewisol, e-bost yn unig)

source: Important message
cy: Neges bwysig

source: Optional message
cy: Neges ddewisol

source: New Video Message
cy: Neges fideo newydd

source: New group message
cy: Neges grŵp newydd

source: New group message from %s
cy: Neges grŵp newydd oddi wrth %s

source: New message
cy: Neges newydd

source: New message on [APPNAME]
cy: Neges newydd ar [APPNAME]

source: New message from [USERNAME]
cy: Neges newydd oddi wrth [USERNAME]

source: New message from %@
cy: Neges newydd oddi wrth %@

source: New message from %@ %@
cy: Neges newydd oddi wrth %@ %@

source: New message from %s
cy: Neges newydd oddi wrth %s

source: Message Deleted
cy: Neges wedi'i ddileu

source: Context Help Messages
cy: Negeseuon cymorth cyd-destun

source: Fun Video Messages
cy: Negeseuon Fideo Hwylus

source: UNSENT MESSAGES
cy: NEGESEUON HEB EU HANFON

source: Messages from [APPNAME]
cy: Negeseuon oddi wrth [APPNAME]

source: Other Messengers
cy: Negeswyr Eraill

source: Next
cy: Nesaf

source: Next &gt;
cy: Nesaf &gt;

source: Next, choose your password.
cy: Nesaf, dewiswch eich cyfrinair.

source: Zoom In
cy: Nesáu

source: Zoom
cy: Nesáu/pellhau

source: Default Zoom.
cy: Nesáu/pellhau Diofyn.

source: Zoom to Fit
cy: Nesáu/pellhau i ffitio

source: Zoom to Actual Size
cy: Nesáu/pellhau i'r union faint

source: Maximum Zoom.
cy: Nesáu/pellhau mwyaf.

source: or
cy: neu

source: OR BROWSE MORE COURSES
cy: NEU BORI MWY O GYRSIAU

source: Or log in with your Google account:
cy: Neu fewngofnodwch gyda'ch cyfrif Google:

source: or Import existing one
cy: neu mewngludwch un presennol

source: Or add forgotten events afterwards.
cy: Neu ychwanegu digwyddiadau angof wedyn.

source: Or, maybe quicker:
cy: Neu, efallai bod hwn yn gyflymach:

source: Great Hall
cy: Neuadd Fawr

source: Change
cy: Newid

source: Change Passcode
cy: Newid cod cyfrin

source: Switch Accounts
cy: Newid Cyfrif

source: Change Password
cy: Newid cyfrinair

source: Change font
cy: Newid ffont

source: Change My Availability
cy: Newid fy Argaeledd

source: Convert to path
cy: Newid i lwybr

source: Change profile picture
cy: Newid llun proffil

source: Change phone number
cy: Newid rhif ffôn

source: Quickly change the current task you're recording.
cy: Newid y dasg bresennol rydych yn ei chofnodi yn gyflym.

source: Change day week starts
cy: Newid y diwrnod mae'r wythnos yn dechrau

source: Switch Layout
cy: Newid y Gosodiad

source: Easily change from received to sent!
cy: Newid yn hawdd o dderbyniwyd i anfonwyd!

source: Unsaved changes
cy: Newidiadau heb eu cadw

source: Changes saved
cy: Newidiadau wedi'u cadw

source: Departure Terminal changed
cy: Newidiodd y Derfynfa Adael

source: Departure Gate changed
cy: Newidiodd y Gât Adael

source: Departure time changed
cy: Newidiodd yr amser gadael

source: Invoice state changed manually to %@
cy: Newidiwyd cyflwr yr anfoneb i %@

source: Overtime settings for this project were changed. Theses settings will be used for your future entries. Do you want to update the overtime rates for your past entries?
cy: Newidiwyd y gosodiadau goramser ar gyfer y prosiect hwn. Bydd y gosodiadau hyn yn cael eu defnyddio ar gyfer eich cofnodion yn y dyfodol. Ydych chi am ddiweddaru'r cyfraddau goramser ar gyfer eich cofnodion blaenorol?

source: New
cy: Newydd

source: Just [APPNAME]
cy: Newydd ragfynegi!

source: Just [APPNAME] on "%1$@"
cy: Newydd ragfynegi! ar "%1$@"

source: New here?
cy: Newydd yma?

source: News
cy: Newyddion

source: News Feed
cy: Newyddion

source: News and game highlights
cy: Newyddion ac uchafbwyntiau gemau

source: Breaking News
cy: Newyddion diweddaraf

source: Latest News
cy: Newyddion Diweddaraf

source: [APPNAME] can't import this file
cy: Ni all [APPNAME] fewngludo'r ffeil hon

source: [APPNAME] can't save your entry
cy: Ni all [APPNAME] gadw'ch cofnod

source: [APPNAME] can't access your calendar
cy: Ni all [APPNAME] gael mynediad at eich calendr

source: Password can't be blank
cy: Ni all y cyfrinair fod yn wag

source: New password can't be blank
cy: Ni all y cyfrinair newydd fod yn wag

source: Password confirmation field can't be blank
cy: Ni all y maes cadarnhau cyfrinair fod yn wag

source: Project and client name must not be empty. Provide unique project name
cy: Ni all y prosiect nac enw'r cleient fod yn wag. Darparwch enw unigryw ar gyfer y prosiect

source: Email can't be blank
cy: Ni all yr e-bost fod yn wag

source: Username cannot be longer than %1$s characters
cy: Ni all yr enw defnyddiwr fod yn hirach na %1$s nod

source: Username can't be blank
cy: Ni all yr enw defnyddiwr fod yn wag

source: Username cannot be empty
cy: Ni all yr enw defnyddiwr fod yn wag

source: Name cannot be longer than %1$s characters
cy: Ni all yr enw fod yn hirach na %1$s nod

source: Name can't be blank
cy: Ni all yr enw fod yn wag

source: Old password can't be blank
cy: Ni all yr hen gyfrinair fod yn wag

source: Could not find your location
cy: Ni allwn ddod o hyd i'ch lleoliad

source: Invite has not been sent
cy: Ni anfonwyd y gwahoddiad

source: Whoops! Sending failed. Tap for more options
cy: Ni anfonwyd y neges, tapiwch am ragor o opsiynau

source: E-Mail not sent
cy: Ni anfonwyd yr e-bost

source: No camera found!
cy: Ni ddaethpwyd o hyd i gamera!

source: Google Play not found on device
cy: Ni ddaethpwyd o hyd i Google Play ar y ddyfais

source: Instagram not found
cy: Ni ddaethpwyd o hyd i Instagram

source: No location found
cy: Ni ddaethpwyd o hyd i leoliad

source: No users found
cy: Ni ddaethpwyd o hyd i unrhyw ddefnyddwyr

source: No facebook friends found. Invite some! :)
cy: Ni ddaethpwyd o hyd i unrhyw ffrindiau ar facebook. Gwahoddwch rai! :)

source: No Results Found
cy: Ni ddaethpwyd o hyd i unrhyw ganlyniadau

source: No time entries found
cy: Ni ddaethpwyd o hyd i unrhyw gofnodion amser

source: No offers found for your search. Try to change departure/arrival address or date
cy: Ni ddaethpwyd o hyd i unrhyw gynigion ar gyfer eich chwiliad. Ceisiwch newid eich cyfeiriad neu ddyddiad gadael/cyrraedd

source: No suitable application found for sharing.
cy: Ni ddaethpwyd o hyd i unrhyw raglen addas ar gyfer rhannu.

source: Verify code not found
cy: Ni ddaethpwyd o hyd i'r cod dilysu

source: Email not found
cy: Ni ddaethpwyd o hyd i'r e-bost

source: No Days Selected
cy: Ni ddetholwyd unrhyw ddiwrnodau

source: This CANNOT be undone.
cy: NI ellir dad-wneud hyn.

source: No location could be found. You might be offline right now.
cy: Ni ellir dod o hyd i leoliad. Efallai eich bod all-lein ar hyn o bryd.

source: Score not found on Game Center
cy: Ni ellir dod o hyd i'r sgôr yn y Game Center

source: This map could not be downloaded from iCloud. Please try again later.
cy: Ni ellir lawrlwytho'r map hwn o iCloud. Rhowch gynnig arall arni'n nes ymlaen.

source: Non billable entries and expenses won't show up in overviews
cy: Ni fydd cofnodion ni ellir bilio amdanynt a chostau traul yn dangos yn trosolygon

source: Events shorter than the minimum duration will not be saved.
cy: Ni fydd digwyddiadau sy'n fyrrach na'r cyfnod isafswm yn cael eu cadw.

source: Your address will not be added to a marketing email list.
cy: Ni fydd eich cyfeiriad yn cael ei ychwanegu at restr marchnata e-bost.

source: Your personal details will not be passed on to any third party.
cy: Ni fydd eich manylion personol yn cael eu pasio ymlaen at unrhyw drydydd parti.

source: It won't take more than a minute. Thanks for your support!
cy: Ni fydd yn cymryd mwy na munud. Diolch am eich cefnogaeth!

source: Notification about successful synchronisation won't show up
cy: Ni fydd yr hysbysiad am gysoni'n llwyddiannus yn ymddangos

source: You will not even notice the difference in battery consumption.
cy: Ni fyddwch hyd yn oed yn sylwi ar y gwahaniaeth yn nefnydd y batri.

source: We will not display your email to other [APPNAME] users.
cy: Ni fyddwn yn dangos eich e-bost i ddefnyddwyr eraill [APPNAME].

source: We will not display your phone number to other [APPNAME] users.
cy: Ni fyddwn yn dangos eich rhif ffôn i ddefnyddwyr eraill [APPNAME].

source: No developers where harmed in the making of this app.
cy: Ni niweidiwyd unrhyw ddatblygwyr yn y broses o wneud yr ap hwn.

source: No locations assigned.
cy: Ni phennwyd unrhyw leoliadau.

source: No positions assigned.
cy: Ni phennwyd unrhyw swyddi.

source: Photo not posted
cy: Ni phostiwyd y llun

source: No one added
cy: Ni ychwanegwyd unrhyw un

source: Not just the app …
cy: Nid dim ond yr ap…

source: This is not a website
cy: Nid gwefan yw hwn

source: Could Not Send Message.
cy: Nid oedd modd anfon y neges.

source: Verification could not be completed.
cy: Nid oedd modd cwblhau'r broses o ddilysu.

source: Signup could not be completed.
cy: Nid oedd modd cwblhau'r broses o gofrestru.

source: Friend request response failed. Please try again.
cy: Nid oedd modd dileu'r cais ffrind, rhowch gynnig arall arni.

source: Your profile couldn't be updated!
cy: Nid oedd modd diweddaru'ch proffil!

source: Could not update data. Please try again later.
cy: Nid oedd modd diweddaru'r data. Rhowch gynnig arall arni nes ymlaen.
